# 使用二维列表存储车次信息
lst=[
    ['车次','出发站-到达站','出发时间','到达时间','历时时长'],
    ['G1569','北京南-天津南','18:06','18:39','00:33'],
    ['G1567','北京南-天津南','18:15','18:49','00:34'],
    ['G8917','北京南-天津西','18:20','19:19','00:59'],
    ['G203','北京南-天津南','18:35','19:09','00:34'],
]
for i in range(len(lst)):
    for j in range(len(lst[i])):
        print(lst[i][j],end=' ')
    print()

flag=False
while not flag:   #若是单次查询车次，可以不使用while循环
    x=input('请输入要购买的车次：')
    for i in range(1,len(lst)):
        if x==lst[i][0]:
            name=input('请输入乘车人，如果是多位乘车人用逗号分隔:')
            print('您已购买了'+lst[i][0],lst[i][1],lst[i][2]+'开,请'+name+'尽快换取纸质车票。【铁路客服】')
            flag=True
            break   #终止for循环
    if flag:
        break  #终止while循环
    else:
        print('未查询到该车次信息！')

print('-'*50)

# 使用组合数据类型 字典+列表 存储车次信息
d={
    'G1569':['北京南-天津南','18:06','18:39','00:33'],
    'G1567':['北京南-天津南','18:15','18:49','00:34'],
    'G8917':['北京南-天津西','18:20','19:19','00:59'],
    'G203':['北京南-天津南','18:35','19:09','00:34']
   }
print('车次','出发站-到达站','出发时间','到达时间','历时时长')
for key,value in d.items():
    print(key,end=' ')
    for item in value:
        print(item,end=' ')
    print()

x=input('请输入要购买的车次：')
if d.get(x):
    name = input('请输入乘车人，如果是多位乘车人用逗号分隔:')
    print('您已购买了' +x,d.get(x)[0], d.get(x)[1]+ '开,请' + name + '尽快换取纸质车票。【铁路客服】')
else:
    print('车次不存在！')